backend/app/controllers/admins/catalogs_controller.rb

  def index
    respond_to do |format|
      format.html
      format.json do
        render json: {
          catalogs: Catalog.order(created_at: :desc).page(params[:page] || 1).per(params[:per_page] || 10),
          catalogs_selection: (params[:is_load_catalogs_selection] == "true" ? Catalog.all.order(created_at: :desc) : {}),
          total_items: Catalog.all.count
---
SELECT  `catalogs`.* FROM `catalogs` ORDER BY `catalogs`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `catalogs`

  def create
    catalog = Catalog.new catalog_params
    status = catalog.save
---
INSERT INTO `catalogs` (`name`, `parent_id`, `slug`, `created_at`, `updated_at`) VALUES ('sao nó không tự load', 16, 'sao-no-khong-tu-load', '2018-11-01 06:30:31', '2018-11-01 06:30:31')

  def update
    status = @catalog.update_attributes catalog_params
---
UPDATE `catalogs` SET `name` = 'asd asd á sascas dá dá', `parent_id` = 2, `slug` = 'asd-asd-a-sascas-da-da', `updated_at` = '2018-11-01 06:22:46' WHERE `catalogs`.`id` = 12

  def destroy
    status = @catalog.destroy
---
DELETE FROM `catalogs` WHERE `catalogs`.`id` = 10

  def load_catalog
    @catalog = Catalog.friendly.find params[:id]
---
SELECT  `catalogs`.* FROM `catalogs` WHERE `catalogs`.`id` = 11 LIMIT 1