backend/app/controllers/admins/categories_controller.rb

SELECT  `categories`.* FROM `categories` ORDER BY `categories`.`created_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `categories`
---
  def index
    respond_to do |format|
      format.html
      format.json do
        render json: {
          categories: Category.order(created_at: :desc).page(params[:page] || 1).per(params[:per_page] || 10),
          total_items: Category.all.count

INSERT INTO `categories` (`name`, `slug`, `created_at`, `updated_at`) VALUES ('thêm cái mới', 'them-cai-m-i', '2018-11-02 03:20:20', '2018-11-02 03:20:20')
---
  def create
    category = Category.new category_params
    status = category.save

DELETE FROM `categories` WHERE `categories`.`id` = 5
---
  def destroy
    status = @category&.destroy

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1
---
  def load_category
    @category = Category.find_by id: params[:id]