backend/app/controllers/admins/providers_controller.rb

  def index
    @providers = Provider.all
---
SELECT `providers`.* FROM `providers`